Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.ModelSharingServerPath Property
Note: This API is now obsolete.
 The server path for model sharing. Is null if not defined for the model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Does currently nothing. Will be removed in near future.")]
public Uri ModelSharingServerPath { get; set; }
<ObsoleteAttribute("Does currently nothing. Will be removed in near future.")>
Public Property ModelSharingServerPath As Uri
	Get
	Set
Property Value
Type: Uri
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace